"""
Метою цієї задачі є моделювання чисел, розташованих по спіралі, та знаходження їхнього значення у певній координаті. Припустимо, що ми починаємо з числа один на початку координат (x=0, y=0) двовимірної системи координат. Число два знаходиться праворуч від нього (x=1, y=0), число три - вгорі (x=1, y=1), а число чотири - ліворуч (x=0, y=1). Числа зростають по спіралі проти годинникової стрілки.

Загальне розміщення

У загальному випадку числа розміщуються по спіралі за годинниковою стрілкою наступним чином:
Число 1 розміщується у позиції (0, 0)
Цифра 2 розміщується в позиції (1, 0)
Цифра 3 розміщується у позиції (1, 1)
Число 4 розміщено в позиції (0, 1)
Номер 5 розміщено в позиції (-1, 1)
Число 6 розміщується в позиції (-1, 0), і так далі.

Візуалізація спірального макета
У таблиці нижче візуалізовано спіральне розташування:

   17    16    15    14    13    
   18    5     4     3     12
   19    6     1     2     11
   20    7     8     9     10
   21    etc...

               2        
               1          
   -2    -1    0     1     2
              -1          
              -2

Завдання:

Вам потрібно написати функцію Python get_spiral_value(x, y), яка повертає значення за координатами (x, y). Зверніть увагу, що x та y можуть бути як від'ємними, так і додатними цілими числами.

Приклади

get_spiral_value(2, 2) -> 13

get_spiral_value(1, 0) -> 2

"""


def get_spiral_value(target_x, target_y):
    x = 0
    y = 0
    value = 1
    direction = 0
    step_length = 1

    while True:
        for _ in range(2):
            for _ in range(step_length):
                if target_x == x and target_y == y:
                    return value

                if direction == 0:  # право
                    x += 1
                elif direction == 1:  # вгору
                    y += 1
                elif direction == 2:  # вліво
                    x -= 1
                elif direction == 3:  # вниз
                    y -= 1

                value += 1
            direction = (direction + 1) % 4

        step_length += 1


print(get_spiral_value(2, 2))
print(get_spiral_value(1, 0))
